In [1]:
import pandas as pd

### Two different data types

1. Series - one dimension data type

In [2]:
car_data = pd.Series(["BMW","Benz","Audi"])
car_data

0     BMW
1    Benz
2    Audi
dtype: object

In [3]:
car_color = pd.Series(["white","black","red"])
car_color

0    white
1    black
2      red
dtype: object

2. Dataframe - two dimension data type

In [4]:
car = pd.DataFrame({"Car brand": car_data, "Color": car_color})
car

  Car brand  Color
0       BMW  white
1      Benz  black
2      Audi    red

### How to import data using pandas

In [79]:
car_sales = pd.read_csv("./data/car-sales.csv")
car_sales

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

### How to export data using pandas

In [58]:
car_sales.to_csv("./data/Exported-version-carSales.csv", index = False)

In [10]:
exported_carSales = pd.read_csv("./data/Exported-version-carSales.csv")
exported_carSales

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

### Outside the note
#### Difference between an attribute and function

1. Attribute - the syntax requires no brackets

In [12]:
car_sales.dtypes

Make             object
Colour           object
Odometer (KM)     int64
Doors             int64
Price            object
dtype: object

In [15]:
car_sales.index

RangeIndex(start=0, stop=10, step=1)

In [16]:
car_sales.columns

Index(['Make', 'Colour', 'Odometer (KM)', 'Doors', 'Price'], dtype='object')

2. Function - the syntax requires brackets

In [14]:
car_sales.head(2)

     Make Colour  Odometer (KM)  Doors      Price
0  Toyota  White         150043      4  $4,000.00
1   Honda    Red          87899      4  $5,000.00

In [17]:
car_sales.describe()

       Odometer (KM)      Doors
count      10.000000  10.000000
mean    78601.400000   4.000000
std     61983.471735   0.471405
min     11179.000000   3.000000
25%     35836.250000   4.000000
50%     57369.000000   4.000000
75%     96384.500000   4.000000
max    213095.000000   5.000000

In [19]:
car_sales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Make           10 non-null     object
 1   Colour         10 non-null     object
 2   Odometer (KM)  10 non-null     int64
 3   Doors          10 non-null     int64
 4   Price          10 non-null     object
dtypes: int64(2), object(3)
memory usage: 528.0+ bytes

In [80]:
car_sales['Price'] = car_sales['Price'].astype(str).str[1:]

In [83]:
car_sales['Price'] = car_sales['Price'].astype(float)

ValueError: could not convert string to float: '4,000.00'

In [67]:
car_sales

     Make Colour  Odometer (KM)  Doors      Price
0  Toyota  White         150043      4   4,000.00
1   Honda    Red          87899      4   5,000.00
2  Toyota   Blue          32549      3   7,000.00
3     BMW  Black          11179      5  22,000.00
4  Nissan  White         213095      4   3,500.00
5  Toyota  Green          99213      4   4,500.00
6   Honda   Blue          45698      4   7,500.00
7   Honda   Blue          54738      4   7,000.00
8  Toyota  White          60000      4   6,250.00
9  Nissan  White          31600      4   9,700.00